In [1]:
#!pip install pip install scikit-learn

In [2]:
import os
os.getcwd()

'C:\\Users\\ASUS-I7-NB\\Desktop\\人工智慧與金融應用\\期末報告_Bitcoin'

##### Bitcoin price download: https://finance.yahoo.com/quote/BTC-USD/history?p=BTC-USD
##### talib whl 檔案下載位置:  https://www.lfd.uci.edu/~gohlke/pythonlibs/#ta-lib
##### talib 安裝指令: pip install TA_Lib-0.4.20-cp38-cp38-win_amd64.whl
##### talib 使用方式: http://mrjbq7.github.io/ta-lib/

In [3]:
import pandas as pd

In [4]:
pd.read_excel("BTC-USD.xlsx").head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800.0
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200.0
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700.0
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,36863600.0
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,26580100.0

In [5]:
BTC = pd.read_excel("BTC-USD.xlsx")

In [6]:
BTC.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800.0
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200.0
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700.0

In [7]:
BTC.shape

(2437, 7)

In [8]:
import pandas as pd
import numpy as np

In [9]:
inputs = {
    'open': np.random.random(5),
    'high': np.random.random(5),
    'low': np.random.random(5),
    'close': np.random.random(5),
    'volume': np.random.random(5)
}

In [10]:
print(type(inputs))
inputs

<class 'dict'>

{'open': array([0.84123176, 0.15290532, 0.63546015, 0.48968524, 0.01285699]),
 'high': array([0.66835637, 0.39799633, 0.88067658, 0.03206332, 0.71893982]),
 'low': array([0.40831072, 0.42387921, 0.40689736, 0.31895316, 0.79010252]),
 'close': array([0.7249834 , 0.00222314, 0.06915106, 0.05048847, 0.50710881]),
 'volume': array([0.28992984, 0.26153491, 0.04287081, 0.83790993, 0.89229856])}

In [11]:
print(type(inputs["open"]))
inputs["open"]

<class 'numpy.ndarray'>

array([0.84123176, 0.15290532, 0.63546015, 0.48968524, 0.01285699])

In [12]:
print(type(np.random.random(5)))
np.random.random(5)

<class 'numpy.ndarray'>

array([0.84478624, 0.78331234, 0.5509109 , 0.11185607, 0.87616981])

In [13]:
BTC.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800.0
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200.0
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700.0
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,36863600.0
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,26580100.0

In [14]:
print(type(BTC["Open"]))
BTC["Open"]

<class 'pandas.core.series.Series'>

0         465.864014
1         456.859985
2         424.102997
3         394.673004
4         408.084991
            ...
2432    49855.496094
2433    46716.636719
2434    46415.898438
2435    43488.058594
2436    42673.000000
Name: Open, Length: 2437, dtype: float64

In [15]:

inputs = {
    'open': BTC["Open"],
    'high': BTC["High"],
    'low':  BTC["Low"],
    'close':  BTC["Adj Close"],
    'volume': BTC["Volume"]
}

In [16]:
from talib.abstract import *

In [17]:
inputs["open"]

0         465.864014
1         456.859985
2         424.102997
3         394.673004
4         408.084991
            ...
2432    49855.496094
2433    46716.636719
2434    46415.898438
2435    43488.058594
2436    42673.000000
Name: Open, Length: 2437, dtype: float64

In [18]:
pd.isna(BTC)

       Date   Open   High    Low  Close  Adj Close  Volume
0     False  False  False  False  False      False   False
1     False  False  False  False  False      False   False
2     False  False  False  False  False      False   False
3     False  False  False  False  False      False   False
4     False  False  False  False  False      False   False
...     ...    ...    ...    ...    ...        ...     ...
2432  False  False  False  False  False      False   False
2433  False  False  False  False  False      False   False
2434  False  False  False  False  False      False   False
2435  False  False  False  False  False      False   False
2436  False  False  False  False  False      False   False

[2437 rows x 7 columns]

In [19]:
BTC.isnull().values.any()

True

In [20]:
pd.DataFrame(BTC).dropna()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,2.105680e+07
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,3.448320e+07
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,3.791970e+07
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,3.686360e+07
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,2.658010e+07
...,...,...,...,...,...,...,...
2432,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10
2433,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10
2434,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10
2435,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10
2436,2021-05-19,42673.000000,43546.117188,38787.902344,39321.777344,39321.777344,6.756428e+10

In [21]:
modify_BTC = pd.DataFrame(BTC).dropna()

In [22]:
modify_BTC = modify_BTC.reset_index().drop(columns=['index'])

In [23]:
modify_BTC

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,2.105680e+07
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,3.448320e+07
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,3.791970e+07
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,3.686360e+07
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,2.658010e+07
...,...,...,...,...,...,...,...
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10
2432,2021-05-19,42673.000000,43546.117188,38787.902344,39321.777344,39321.777344,6.756428e+10

In [24]:
inputs = {
    'open': modify_BTC["Open"],
    'high': modify_BTC["High"],
    'low':  modify_BTC["Low"],
    'close':  modify_BTC["Adj Close"],
    'volume': modify_BTC["Volume"]
}

In [25]:
pd.DataFrame(SMA(inputs, timeperiod = 5, price='open')).head(10)

            0
0         NaN
1         NaN
2         NaN
3         NaN
4  429.916998
5  416.564197
6  405.610602
7  407.940204
8  413.636804
9  414.305603

In [26]:
RSI_14 = RSI(inputs["close"], timeperiod=14)
TEMA_30 = TEMA(inputs["close"], timeperiod=30)

open_5ma   = SMA(inputs, timeperiod = 5, price='open')
close_5ma  = SMA(inputs, timeperiod = 5, price='close')
close_10ma = SMA(inputs, timeperiod = 10, price='close')
close_20ma = SMA(inputs, timeperiod = 20, price='close')

MOM_10 = MOM(inputs["close"], timeperiod=10)

MFI_5 = MFI(inputs["high"], inputs["low"], inputs["close"], inputs["volume"], timeperiod=5)
MFI_14 = MFI(inputs["high"], inputs["low"], inputs["close"], inputs["volume"], timeperiod=14)
MFI_20 = MFI(inputs["high"], inputs["low"], inputs["close"], inputs["volume"], timeperiod=20)

close_30kama = KAMA(inputs, timeperiod = 30, price='close')
midprice_14 = MIDPRICE(inputs["high"], inputs["low"], timeperiod=14)

AD = AD(inputs["high"], inputs["low"], inputs["close"], inputs["volume"])
ADOSC = ADOSC(inputs["high"], inputs["low"], inputs["close"], inputs["volume"], fastperiod=3, slowperiod=10)
OBV = OBV(inputs["close"], inputs["volume"])

In [27]:
modify_BTC.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800.0
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200.0
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700.0

In [28]:
open_5ma

array([          nan,           nan,           nan, ..., 48481.2890628,
       47231.8140628, 45829.817969 ])

In [29]:
modify_BTC["TEMA_30"] = TEMA_30
modify_BTC["RSI_14"] = RSI_14

'''modify_BTC["open_5ma"] = open_5ma
modify_BTC["close_5ma"] = close_5ma
modify_BTC["close_10ma"] = close_10ma
modify_BTC["close_20ma"] = close_20ma'''

'''modify_BTC["MFI_5"] = MFI_5
modify_BTC["MFI_14"] = MFI_14
modify_BTC["MFI_20"] = MFI_20
modify_BTC["MOM_10"] = MOM_10'''

'''modify_BTC["close_30kama"] = close_30kama
modify_BTC["midprice_14"] = midprice_14
modify_BTC["AD"] = AD
modify_BTC["ADOSC"] = ADOSC
modify_BTC["OBV"] = OBV'''

'modify_BTC["close_30kama"] = close_30kama\nmodify_BTC["midprice_14"] = midprice_14\nmodify_BTC["AD"] = AD\nmodify_BTC["ADOSC"] = ADOSC\nmodify_BTC["OBV"] = OBV'

In [30]:
modify_BTC

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,2.105680e+07,NaN,NaN
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,3.448320e+07,NaN,NaN
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,3.791970e+07,NaN,NaN
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,3.686360e+07,NaN,NaN
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,2.658010e+07,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10,51432.721075,34.258567
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10,50234.012475,33.837749
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10,48669.738186,30.026066
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10,47203.949446,29.262100
2432,2021-05-19,42673.000000,43546.117188,38787.902344,39321.777344,39321.777344,6.756428e+10,45290.996062,25.302152

In [31]:
modify_BTC["y"] = None

In [32]:
modify_BTC

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14,y
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,2.105680e+07,NaN,NaN,None
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,3.448320e+07,NaN,NaN,None
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,3.791970e+07,NaN,NaN,None
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,3.686360e+07,NaN,NaN,None
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,2.658010e+07,NaN,NaN,None
...,...,...,...,...,...,...,...,...,...,...
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10,51432.721075,34.258567,None
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10,50234.012475,33.837749,None
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10,48669.738186,30.026066,None
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10,47203.949446,29.262100,None
2432,2021-05-19,42673.000000,43546.117188,38787.902344,39321.777344,39321.777344,6.756428e+10,45290.996062,25.302152,None

In [33]:
import math

In [34]:
math.log(120, 10)

2.0791812460476247

In [35]:
modify_BTC.iloc[1, 5]

424.440002

In [36]:
math.log( modify_BTC.iloc[1, 5]/modify_BTC.iloc[0, 5] , 10)

-0.03241719606846411

In [37]:
modify_BTC.shape[0]

2433

In [38]:
for i in range(0, modify_BTC.shape[0]-1):
    modify_BTC.iloc[i, -1] = math.log( modify_BTC.iloc[i+1, 5]/modify_BTC.iloc[i, 5] , 10)

In [39]:
modify_BTC
#y是指明天的收盤價的投資報酬率

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14,y
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,2.105680e+07,NaN,NaN,-0.032417
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,3.448320e+07,NaN,NaN,-0.031444
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,3.791970e+07,NaN,NaN,0.015249
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,3.686360e+07,NaN,NaN,-0.010843
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,2.658010e+07,NaN,NaN,0.003612
...,...,...,...,...,...,...,...,...,...,...
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10,51432.721075,34.258567,-0.002834
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10,50234.012475,33.837749,-0.028179
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10,48669.738186,30.026066,-0.006311
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10,47203.949446,29.262100,-0.037919
2432,2021-05-19,42673.000000,43546.117188,38787.902344,39321.777344,39321.777344,6.756428e+10,45290.996062,25.302152,None

In [40]:
modify_BTC.dropna()

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14,y
87,2014-12-13,352.381012,352.381012,346.588013,347.376007,347.376007,1.167590e+07,357.191964,39.032848,0.005289
88,2014-12-14,346.726990,353.316010,345.417999,351.631989,351.631989,1.241520e+07,355.469332,42.056095,-0.007835
89,2014-12-15,351.360992,351.815002,344.933990,345.345001,345.345001,1.726420e+07,352.856550,38.981002,-0.023623
90,2014-12-16,345.673004,345.859009,327.062012,327.062012,327.062012,3.086490e+07,347.293870,31.717888,-0.009784
91,2014-12-17,326.855011,333.954010,315.152008,319.776001,319.776001,3.756790e+07,341.152839,29.369381,-0.011533
...,...,...,...,...,...,...,...,...,...,...
2427,2021-05-14,49682.980469,51438.117188,48868.578125,49880.535156,49880.535156,5.573750e+10,52752.150973,38.863158,-0.028055
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10,51432.721075,34.258567,-0.002834
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10,50234.012475,33.837749,-0.028179
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10,48669.738186,30.026066,-0.006311
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10,47203.949446,29.262100,-0.037919

In [41]:
modify_BTC = modify_BTC.dropna()

In [42]:
modify_BTC.head()

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14,y
87,2014-12-13,352.381012,352.381012,346.588013,347.376007,347.376007,11675900.0,357.191964,39.032848,0.005289
88,2014-12-14,346.726990,353.316010,345.417999,351.631989,351.631989,12415200.0,355.469332,42.056095,-0.007835
89,2014-12-15,351.360992,351.815002,344.933990,345.345001,345.345001,17264200.0,352.856550,38.981002,-0.023623
90,2014-12-16,345.673004,345.859009,327.062012,327.062012,327.062012,30864900.0,347.293870,31.717888,-0.009784
91,2014-12-17,326.855011,333.954010,315.152008,319.776001,319.776001,37567900.0,341.152839,29.369381,-0.011533

In [43]:
modify_BTC.tail()

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14,y
2427,2021-05-14,49682.980469,51438.117188,48868.578125,49880.535156,49880.535156,5.573750e+10,52752.150973,38.863158,-0.028055
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10,51432.721075,34.258567,-0.002834
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10,50234.012475,33.837749,-0.028179
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10,48669.738186,30.026066,-0.006311
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10,47203.949446,29.262100,-0.037919

In [44]:
modify_BTC

,Date,Open,High,Low,Close,Adj Close,Volume,TEMA_30,RSI_14,y
87,2014-12-13,352.381012,352.381012,346.588013,347.376007,347.376007,1.167590e+07,357.191964,39.032848,0.005289
88,2014-12-14,346.726990,353.316010,345.417999,351.631989,351.631989,1.241520e+07,355.469332,42.056095,-0.007835
89,2014-12-15,351.360992,351.815002,344.933990,345.345001,345.345001,1.726420e+07,352.856550,38.981002,-0.023623
90,2014-12-16,345.673004,345.859009,327.062012,327.062012,327.062012,3.086490e+07,347.293870,31.717888,-0.009784
91,2014-12-17,326.855011,333.954010,315.152008,319.776001,319.776001,3.756790e+07,341.152839,29.369381,-0.011533
...,...,...,...,...,...,...,...,...,...,...
2427,2021-05-14,49682.980469,51438.117188,48868.578125,49880.535156,49880.535156,5.573750e+10,52752.150973,38.863158,-0.028055
2428,2021-05-15,49855.496094,50639.664063,46664.140625,46760.187500,46760.187500,5.916105e+10,51432.721075,34.258567,-0.002834
2429,2021-05-16,46716.636719,49720.042969,43963.351563,46456.058594,46456.058594,6.404787e+10,50234.012475,33.837749,-0.028179
2430,2021-05-17,46415.898438,46623.558594,42207.289063,43537.511719,43537.511719,7.490364e+10,48669.738186,30.026066,-0.006311
2431,2021-05-18,43488.058594,45812.457031,42367.832031,42909.402344,42909.402344,5.618737e+10,47203.949446,29.262100,-0.037919

In [45]:
modify_BTC.iloc[:, -3: -1]

           TEMA_30     RSI_14
87      357.191964  39.032848
88      355.469332  42.056095
89      352.856550  38.981002
90      347.293870  31.717888
91      341.152839  29.369381
...            ...        ...
2427  52752.150973  38.863158
2428  51432.721075  34.258567
2429  50234.012475  33.837749
2430  48669.738186  30.026066
2431  47203.949446  29.262100

[2345 rows x 2 columns]

In [46]:
X = modify_BTC.iloc[:, -3:-1]

In [47]:
modify_BTC['y']

87      0.005289
88     -0.007835
89     -0.023623
90     -0.009784
91     -0.011533
          ...
2427   -0.028055
2428   -0.002834
2429   -0.028179
2430   -0.006311
2431   -0.037919
Name: y, Length: 2345, dtype: object

In [48]:
y = modify_BTC['y']

In [49]:
X.shape

(2345, 2)

In [50]:
y.shape

(2345,)

In [51]:
X.iloc[:1214, :]

          TEMA_30     RSI_14
87     357.191964  39.032848
88     355.469332  42.056095
89     352.856550  38.981002
90     347.293870  31.717888
91     341.152839  29.369381
...           ...        ...
1296  6843.089711  34.055001
1297  6712.827903  32.620408
1298  6654.020903  37.097140
1299  6628.329993  38.886382
1300  6565.281537  36.380670

[1214 rows x 2 columns]

In [52]:
#X=(X-X.min())/(X.max()-X.min())
X

           TEMA_30     RSI_14
87      357.191964  39.032848
88      355.469332  42.056095
89      352.856550  38.981002
90      347.293870  31.717888
91      341.152839  29.369381
...            ...        ...
2427  52752.150973  38.863158
2428  51432.721075  34.258567
2429  50234.012475  33.837749
2430  48669.738186  30.026066
2431  47203.949446  29.262100

[2345 rows x 2 columns]

In [53]:
X_train = X.iloc[:1214, :]

In [54]:
X.iloc[1214:, :]

           TEMA_30     RSI_14
1301   6526.886269  37.479581
1302   6522.588392  39.814874
1303   6690.745887  52.883442
1304   6843.629357  52.963582
1305   6997.698069  54.094929
...            ...        ...
2427  52752.150973  38.863158
2428  51432.721075  34.258567
2429  50234.012475  33.837749
2430  48669.738186  30.026066
2431  47203.949446  29.262100

[1131 rows x 2 columns]

In [55]:
X_test = X.iloc[1214:, :]

In [56]:
y.iloc[:1214]
#x是1214y也要一樣是1214

87      0.005289
88     -0.007835
89     -0.023623
90     -0.009784
91     -0.011533
          ...
1296   -0.011314
1297    0.017619
1298    0.007008
1299   -0.015919
1300    0.004088
Name: y, Length: 1214, dtype: object

In [57]:
y_train = y.iloc[:1214]

In [58]:
y.iloc[1214:]

1301    0.008405
1302    0.053908
1303    0.000369
1304    0.004937
1305    0.018256
          ...
2427   -0.028055
2428   -0.002834
2429   -0.028179
2430   -0.006311
2431   -0.037919
Name: y, Length: 1131, dtype: object

In [59]:
y_test = y.iloc[1214:]

In [60]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(1214, 2)
(1131, 2)
(1214,)
(1131,)

In [61]:
#用linear reg
import numpy as np
from sklearn.linear_model import LinearRegression

In [62]:
reg = LinearRegression().fit(X_train, y_train)

In [63]:
reg.predict(X_train)

array([-7.72355411e-05,  1.75069141e-04, -8.09625240e-05, ...,
       -1.10391628e-03, -9.51205098e-04, -1.15145882e-03])

In [64]:
reg.predict(X_train).size

1214

In [65]:
y_train.to_numpy()

array([0.0052885584968148675, -0.007835203439796651,
       -0.023623069724478724, ..., 0.007008285858841339,
       -0.015919330414305505, 0.004087759949151458], dtype=object)

In [66]:
from sklearn.metrics import mean_squared_error

In [67]:
y_true_train = y_train.to_numpy()
y_pred_train = reg.predict(X_train)
print("regression train mse: ", round(mean_squared_error(y_true_train, y_pred_train), 10))

regression train mse:  0.0003072567

In [68]:
y_true_test = y_test.to_numpy()
y_pred_test = reg.predict(X_test)
print("regression test mse: ", round(mean_squared_error(y_true_test, y_pred_test), 10))

regression test mse:  0.0002802958

In [69]:
result = []
row = []
row.append("regression train mse: ")
row.append(round(mean_squared_error(y_true_train, y_pred_train), 10))
result.append(row)
row = []
row.append("regression test mse: ")
row.append(round(mean_squared_error(y_true_test, y_pred_test), 10))
result.append(row)
pd.DataFrame(result)

                        0         1
0  regression train mse:   0.000307
1   regression test mse:   0.000280